OpenNuvoton/ML_M55M1_SampleCode/M55M1BSP-3.00.001/SampleCode/NuEdgeWise/_HandPoseRecognition/main.cpp
/**************************************************************************//**
 * @file     main.cpp
 * @version  V1.00
 * @brief    Hand pose recognition sample. Demonstrate hand pose recognition
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#include "BoardInit.hpp"      /* Board initialisation */
#include "log_macros.h"      /* Logging macros (optional) */

#include "BufAttributes.hpp" /* Buffer attributes to be applied */
#include "HandLandmarkModel.hpp"       /* Model API */
#include "PointHistoryClassifierModel.hpp"
#include "HandLandmarkPostProcessing.hpp"
#include "Labels.hpp"
#include "PointHistoryProcessing.hpp"
#include "Classifier.hpp"    /* Classifier for the result */
#include "ClassificationResult.hpp"

#include "imlib.h"          /* Image processing */
#include "framebuffer.h"

#undef PI /* PI macro conflict with CMSIS/DSP */
#include "NuMicro.h"

//#define __PROFILE__
#define __USE_DISPLAY__

#include "Profiler.hpp"

#include "ImageSensor.h"

#if defined (__USE_DISPLAY__)
    #include "Display.h"
#endif

#define NUM_FRAMEBUF 2  //1 or 2
#define ACTIVATION_HL_BUF_SZ ACTIVATION_BUF_SZ
#define HAND_POSE_KEYPOINT 8 //INDEX_FINGER_TIP

typedef enum
{
    eFRAMEBUF_EMPTY,
    eFRAMEBUF_FULL,
    eFRAMEBUF_INF
} E_FRAMEBUF_STATE;

typedef struct
{
    E_FRAMEBUF_STATE eState;
    image_t frameImage;
    std::vector<arm::app::hand_landmark::KeypointResult> results;
} S_FRAMEBUF;


S_FRAMEBUF s_asFramebuf[NUM_FRAMEBUF];

using PointHistoryClassifier = arm::app::Classifier;

namespace arm
{
namespace app
{
/* Tensor arena buffer for handlandmark*/
static uint8_t tensorArenaHandLandmark[ACTIVATION_HL_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;

/* Tensor arena buffer for point history*/
static uint8_t tensorArenaPointHistory[ACTIVATION_PH_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;

/* Optional getter function for the model pointer and its size. */
namespace hand_landmark
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace hand_landmark */

namespace point_history
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace hand_landmark */


} /* namespace app */
} /* namespace arm */

//frame buffer managemnet function
static S_FRAMEBUF *get_empty_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_EMPTY)
            return &s_asFramebuf[i];
    }

    return NULL;
}

static S_FRAMEBUF *get_full_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_FULL)
            return &s_asFramebuf[i];
    }

    return NULL;
}

static S_FRAMEBUF *get_inf_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_INF)
            return &s_asFramebuf[i];
    }

    return NULL;
}

/* Image processing initiate function */
//Used by omv library
#define GLCD_WIDTH 256
#define GLCD_HEIGHT 256

#undef OMV_FB_SIZE
#define OMV_FB_SIZE ((GLCD_WIDTH * GLCD_HEIGHT * 2) + 1024)

__attribute__((section(".bss.sram.data"), aligned(16))) static char fb_array[OMV_FB_SIZE + OMV_FB_ALLOC_SIZE];
__attribute__((section(".bss.sram.data"), aligned(16))) static char jpeg_array[OMV_JPEG_BUF_SIZE];

#if (NUM_FRAMEBUF == 2)
    __attribute__((section(".bss.sram.data"), aligned(32))) static char frame_buf1[OMV_FB_SIZE];
#endif

char *_fb_base = NULL;
char *_fb_end = NULL;
char *_jpeg_buf = NULL;
char *_fballoc = NULL;

static void omv_init()
{
    image_t frameBuffer;
    int i;

    frameBuffer.w = GLCD_WIDTH;
    frameBuffer.h = GLCD_HEIGHT;
    frameBuffer.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    frameBuffer.pixfmt = PIXFORMAT_RGB565;

    _fb_base = fb_array;
    _fb_end =  fb_array + OMV_FB_SIZE - 1;
    _fballoc = _fb_base + OMV_FB_SIZE + OMV_FB_ALLOC_SIZE;
    _jpeg_buf = jpeg_array;

    fb_alloc_init0();

    framebuffer_init0();
    framebuffer_init_from_image(&frameBuffer);

    for (i = 0 ; i < NUM_FRAMEBUF; i++)
    {
        s_asFramebuf[i].eState = eFRAMEBUF_EMPTY;
    }

    framebuffer_init_image(&s_asFramebuf[0].frameImage);

#if (NUM_FRAMEBUF == 2)
    s_asFramebuf[1].frameImage.w = GLCD_WIDTH;
    s_asFramebuf[1].frameImage.h = GLCD_HEIGHT;
    s_asFramebuf[1].frameImage.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    s_asFramebuf[1].frameImage.pixfmt = PIXFORMAT_RGB565;
    s_asFramebuf[1].frameImage.data = (uint8_t *)frame_buf1;
#endif
}

static void DrawHandLandmark(
    const std::vector<arm::app::hand_landmark::KeypointResult> &results,
    image_t *drawImg
)
{
	int i;
	
	arm::app::hand_landmark::KeypointResult keyPoint;
	arm::app::hand_landmark::KeypointResult keyPointTemp;
	
	for(i = 0; i < results.size(); i ++)
	{
		keyPoint = results[i];
		
		//draw points
		imlib_draw_circle(drawImg, keyPoint.m_x, keyPoint.m_y, 1, COLOR_B5_MAX, 1, true);
		
		//draw lines
		if (i == 0)
		{
			//Don't draw line
		}
		else if(i == 5)
		{
			keyPointTemp = results[0];
			imlib_draw_line(drawImg, keyPoint.m_x, keyPoint.m_y, keyPointTemp.m_x, keyPointTemp.m_y, COLOR_B5_MAX, 1);
		}
		else if(i == 9)
		{
			keyPointTemp = results[5];
			imlib_draw_line(drawImg, keyPoint.m_x, keyPoint.m_y, keyPointTemp.m_x, keyPointTemp.m_y, COLOR_B5_MAX, 1);
		}
		else if(i == 13)
		{
			keyPointTemp = results[9];
			imlib_draw_line(drawImg, keyPoint.m_x, keyPoint.m_y, keyPointTemp.m_x, keyPointTemp.m_y, COLOR_B5_MAX, 1);
		}
		else if(i == 17)
		{
			keyPointTemp = results[13];
			imlib_draw_line(drawImg, keyPoint.m_x, keyPoint.m_y, keyPointTemp.m_x, keyPointTemp.m_y, COLOR_B5_MAX, 1);
			keyPointTemp = results[0];
			imlib_draw_line(drawImg, keyPoint.m_x, keyPoint.m_y, keyPointTemp.m_x, keyPointTemp.m_y, COLOR_B5_MAX, 1);
		}
		else
		{
			keyPointTemp = results[ i - 1 ];
			imlib_draw_line(drawImg, keyPoint.m_x, keyPoint.m_y, keyPointTemp.m_x, keyPointTemp.m_y, COLOR_B5_MAX, 1);
		}
	}
}

int main()
{
    /* Initialise the UART module to allow printf related functions (if using retarget) */
    BoardInit();

    /* Model object creation and initialisation. */
    arm::app::HandLandmarkModel handLandmarkModel;
    arm::app::PointHistoryClassifierModel pointHistoryClassifierModel;

    if (!handLandmarkModel.Init(arm::app::tensorArenaHandLandmark,
                    sizeof(arm::app::tensorArenaHandLandmark),
                    arm::app::hand_landmark::GetModelPointer(),
                    arm::app::hand_landmark::GetModelLen()))
    {
        printf_err("Failed to initialise model\n");
        return 1;
    }

    if (!pointHistoryClassifierModel.Init(arm::app::tensorArenaPointHistory ,
                    sizeof(arm::app::tensorArenaPointHistory),
                    arm::app::point_history::GetModelPointer(),
                    arm::app::point_history::GetModelLen()))
    {
        printf_err("Failed to initialise model\n");
        return 1;
    }


    /* Setup cache poicy of tensor arean buffer */
    info("Set tesnor arena cache policy to WTRA \n");
    const std::vector<ARM_MPU_Region_t> mpuConfig =
    {
        {
            // SRAM for tensor arena
            ARM_MPU_RBAR(((unsigned int)arm::app::tensorArenaHandLandmark),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)arm::app::tensorArenaHandLandmark) + ACTIVATION_HL_BUF_SZ - 1),        // Limit
                         eMPU_ATTR_CACHEABLE_WTRA) // Attribute index - Write-Through, Read-allocate
        },
        {
            // SRAM for tensor arena
            ARM_MPU_RBAR(((unsigned int)arm::app::tensorArenaPointHistory),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)arm::app::tensorArenaPointHistory) + ACTIVATION_PH_BUF_SZ - 1),        // Limit
                         eMPU_ATTR_CACHEABLE_WTRA) // Attribute index - Write-Through, Read-allocate
        },
        {
            // Image data from CCAP DMA, so must set frame buffer to Non-cache attribute
            ARM_MPU_RBAR(((unsigned int)fb_array),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)fb_array) + OMV_FB_SIZE - 1),        // Limit
                         eMPU_ATTR_NON_CACHEABLE) // NonCache
        },
#if (NUM_FRAMEBUF == 2)
        {
            // Image data from CCAP DMA, so must set frame buffer to Non-cache attribute
            ARM_MPU_RBAR(((unsigned int)frame_buf1),        // Base
                         ARM_MPU_SH_NON,    // Non-shareable
                         0,                 // Read-only
                         1,                 // Non-Privileged
                         1),                // eXecute Never enabled
            ARM_MPU_RLAR((((unsigned int)frame_buf1) + OMV_FB_SIZE - 1),        // Limit
                         eMPU_ATTR_NON_CACHEABLE) // NonCache
        },
#endif
    };

    // Setup MPU configuration
    InitPreDefMPURegion(&mpuConfig[0], mpuConfig.size());

    TfLiteTensor *inputTensorHandLandmark = handLandmarkModel.GetInputTensor(0);

    if (!inputTensorHandLandmark->dims)
    {
        printf_err("Invalid input tensor dims\n");
        return 2;
    }
    else if (inputTensorHandLandmark->dims->size < 3)
    {
        printf_err("Input tensor dimension should be >= 3\n");
        return 3;
    }

    TfLiteIntArray *inputShape = handLandmarkModel.GetInputShape(0);

    const int inputImgCols = inputShape->data[arm::app::HandLandmarkModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::HandLandmarkModel::ms_inputRowsIdx];
    const uint32_t nChannels = inputShape->data[arm::app::HandLandmarkModel::ms_inputChannelsIdx];

    /* HandLandmark model preprocessing is image conversion from uint8 to [0,1] float values,
     * then quantize them with input quantization info. */
    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensorHandLandmark);

    // postProcess
    arm::app::hand_landmark::HandLandmarkPostProcessing postProcessHandLandmark(0.5);
	
    //label information
    std::vector <std::string> labels;
    GetLabelsVector(labels);

    /* Set up pre and post-processing. */
    arm::app::PointHistoryPreProcess preProcessPointHistory = arm::app::PointHistoryPreProcess(&pointHistoryClassifierModel);

    std::vector<arm::app::ClassificationResult> results;
    std::string predictLabelInfo;
    PointHistoryClassifier classifier;  /* Classifier object. */
    arm::app::PointHistoryPostProcess postProcessPointHistory = arm::app::PointHistoryPostProcess(classifier, &pointHistoryClassifierModel,
                                                                              labels, results);
    //display framebuffer
    image_t frameBuffer;
    rectangle_t roi;

    //omv library init
    omv_init();
    framebuffer_init_image(&frameBuffer);

#if defined(__PROFILE__)

    arm::app::Profiler profiler;
    uint64_t u64StartCycle;
    uint64_t u64EndCycle;
    uint64_t u64CCAPStartCycle;
    uint64_t u64CCAPEndCycle;
#else
    pmu_reset_counters();
#endif

#define EACH_PERF_SEC 5
    uint64_t u64PerfCycle;
    uint64_t u64PerfFrames = 0;

    u64PerfCycle = pmu_get_systick_Count();
    u64PerfCycle += (SystemCoreClock * EACH_PERF_SEC);

    S_FRAMEBUF *infFramebuf;
    S_FRAMEBUF *fullFramebuf;
    S_FRAMEBUF *emptyFramebuf;

    //Setup image senosr
    ImageSensor_Init();
    ImageSensor_Config(eIMAGE_FMT_RGB565, frameBuffer.w, frameBuffer.h, true);

#if defined (__USE_DISPLAY__)
    char szDisplayText[100];
    S_DISP_RECT sDispRect;

    Display_Init();
    Display_ClearLCD(C_WHITE);
#endif
	bool bCollectPointDone;

    while (1)
    {
        emptyFramebuf = get_empty_framebuf();

        if (emptyFramebuf)
        {
            //capture frame from CCAP
#if defined(__PROFILE__)
            u64CCAPStartCycle = pmu_get_systick_Count();
#endif

            ImageSensor_TriggerCapture((uint32_t)(emptyFramebuf->frameImage.data));
		}
		
        fullFramebuf = get_full_framebuf();

        if (fullFramebuf)
        {
            //resize full image to input tensor
            image_t resizeImg;

            roi.x = 0;
            roi.y = 0;
            roi.w = fullFramebuf->frameImage.w;
            roi.h = fullFramebuf->frameImage.h;

            resizeImg.w = inputImgCols;
            resizeImg.h = inputImgRows;
            resizeImg.data = (uint8_t *)inputTensorHandLandmark->data.data; //direct resize to input tensor buffer
            resizeImg.pixfmt = PIXFORMAT_RGB888;

#if defined(__PROFILE__)
            u64StartCycle = pmu_get_systick_Count();
#endif
            imlib_nvt_scale(&fullFramebuf->frameImage, &resizeImg, &roi);

#if defined(__PROFILE__)
            u64EndCycle = pmu_get_systick_Count();
            info("resize cycles %llu \n", (u64EndCycle - u64StartCycle));
#endif

#if defined(__PROFILE__)
            u64StartCycle = pmu_get_systick_Count();
#endif
			//Quantize input tensor data
			auto *req_data = static_cast<uint8_t *>(inputTensorHandLandmark->data.data);
			auto *signed_req_data = static_cast<int8_t *>(inputTensorHandLandmark->data.data);

			for (size_t i = 0; i < inputTensorHandLandmark->bytes; i++)
			{
				auto i_data_int8 = static_cast<int8_t>(((static_cast<float>(req_data[i]) / 255.0f) / inQuantParams.scale) + inQuantParams.offset);
				signed_req_data[i] = std::min<int8_t>(INT8_MAX, std::max<int8_t>(i_data_int8, INT8_MIN));
			}

#if defined(__PROFILE__)
            u64EndCycle = pmu_get_systick_Count();
            info("quantize cycles %llu \n", (u64EndCycle - u64StartCycle));
#endif

#if defined(__PROFILE__)
			profiler.StartProfiling("Inference");
#endif

			handLandmarkModel.RunInference();

#if defined(__PROFILE__)
			profiler.StopProfiling();
			profiler.PrintProfilingResult();
#endif

            fullFramebuf->eState = eFRAMEBUF_INF;
        }
		
        infFramebuf = get_inf_framebuf();

        if (infFramebuf)
        {
			//post process
			TfLiteTensor *modelOutput0 = handLandmarkModel.GetOutputTensor(0);
			TfLiteTensor *modelOutput1 = handLandmarkModel.GetOutputTensor(1);

#if defined(__PROFILE__)
			u64StartCycle = pmu_get_systick_Count();
#endif
			postProcessHandLandmark.RunPostProcessing(
				inputImgCols,
				inputImgRows,
				infFramebuf->frameImage.w,
				infFramebuf->frameImage.h,
				modelOutput0,
				modelOutput1,
				infFramebuf->results);

#if defined(__PROFILE__)
			u64EndCycle = pmu_get_systick_Count();
			info("post processing cycles %llu \n", (u64EndCycle - u64StartCycle));
#endif

			if(infFramebuf->results.size())
			{
				//draw hand landmark
				DrawHandLandmark(infFramebuf->results, &infFramebuf->frameImage);

				//collect point
				arm::app::PointHistoryPreProcess::S_POINT_COORD sPointCoord;
				sPointCoord.i32X = infFramebuf->results[HAND_POSE_KEYPOINT].m_x;
				sPointCoord.i32Y = infFramebuf->results[HAND_POSE_KEYPOINT].m_y;

				bCollectPointDone = preProcessPointHistory.CollectPoint(&sPointCoord, infFramebuf->frameImage.w, infFramebuf->frameImage.h);
			}
			else
			{
				bCollectPointDone = false;
				preProcessPointHistory.ResetPointHistory();
			}

			
			if(bCollectPointDone)
			{
				//run point history model 
				preProcessPointHistory.DoPreProcess(nullptr, 0);
				pointHistoryClassifierModel.RunInference();
				postProcessPointHistory.DoPostProcess();
			}
			
            //display result image
#if defined (__USE_DISPLAY__)
            //Display image on LCD
            sDispRect.u32TopLeftX = 0;
            sDispRect.u32TopLeftY = 0;
            sDispRect.u32BottonRightX = (infFramebuf->frameImage.w - 1);
            sDispRect.u32BottonRightY = (infFramebuf->frameImage.h - 1);

#if defined(__PROFILE__)
            u64StartCycle = pmu_get_systick_Count();
#endif

            Display_FillRect((uint16_t *)infFramebuf->frameImage.data, &sDispRect);

#if defined(__PROFILE__)
            u64EndCycle = pmu_get_systick_Count();
            info("display image cycles %llu \n", (u64EndCycle - u64StartCycle));
#endif

#endif

            u64PerfFrames ++;
			if ((uint64_t) pmu_get_systick_Count() > u64PerfCycle)
            {
				if(bCollectPointDone)
				{
					info("Pose: %s(%f), frame rate: %llu \n", results[0].m_label.c_str(), results[0].m_normalisedVal, u64PerfFrames / EACH_PERF_SEC);
				}
				else
				{
					info("Frame rate: %llu\n", u64PerfFrames / EACH_PERF_SEC);
				}

#if defined (__USE_DISPLAY__)
				if(bCollectPointDone)
					sprintf(szDisplayText, "Pose: %s(%f), frame rate: %llu", results[0].m_label.c_str(), results[0].m_normalisedVal, u64PerfFrames / EACH_PERF_SEC);
				else
					sprintf(szDisplayText, "Frame rate: %llu", u64PerfFrames / EACH_PERF_SEC);
                //sprintf(szDisplayText,"Time %llu",(uint64_t) pmu_get_systick_Count() / (uint64_t)SystemCoreClock);
                //info("Running %s sec \n", szDisplayText);
#endif

                u64PerfCycle = (uint64_t)pmu_get_systick_Count() + (uint64_t)(SystemCoreClock * EACH_PERF_SEC);
                u64PerfFrames = 0;
			}
			else
			{
				if(bCollectPointDone)
				{
					info("Pose: %s(%f)\n", results[0].m_label.c_str(), results[0].m_normalisedVal);
					info("Pose 1: %s(%f)\n", results[1].m_label.c_str(), results[1].m_normalisedVal);
					info("Pose 2: %s(%f)\n", results[2].m_label.c_str(), results[2].m_normalisedVal);
				}

#if defined (__USE_DISPLAY__)
				if(bCollectPointDone)
					sprintf(szDisplayText, "Pose: %s(%f)", results[0].m_label.c_str(), results[0].m_normalisedVal);
				else
					sprintf(szDisplayText, " ");
                //sprintf(szDisplayText,"Time %llu",(uint64_t) pmu_get_systick_Count() / (uint64_t)SystemCoreClock);
                //info("Running %s sec \n", szDisplayText);
#endif

			}

#if defined (__USE_DISPLAY__)

			sDispRect.u32TopLeftX = 0;
			sDispRect.u32TopLeftY = frameBuffer.h;
			sDispRect.u32BottonRightX = Disaplay_GetLCDWidth();
			sDispRect.u32BottonRightY = (frameBuffer.h + (FONT_HTIGHT) - 1);
			
			Display_ClearRect(C_WHITE, &sDispRect);
			Display_PutText(
				szDisplayText,
				strlen(szDisplayText),
				0,
				frameBuffer.h,
				C_BLUE,
				C_WHITE,
				false
			);

#endif

            infFramebuf->eState = eFRAMEBUF_EMPTY;
		}

		//Wait CCAP ready
		if (emptyFramebuf)
		{
			//Capture new image

			ImageSensor_WaitCaptureDone();
#if defined(__PROFILE__)
			u64CCAPEndCycle = pmu_get_systick_Count();
			info("ccap capture cycles %llu \n", (u64CCAPEndCycle - u64CCAPStartCycle));
#endif
            emptyFramebuf->eState = eFRAMEBUF_FULL;		
		}
    }

    return 0;
}
